import React, { Component } from 'react';
import $ from 'jquery';
import * as d3 from "d3";
import { event } from 'd3-selection'; 
import './style.css';
import { PieDraw } from './Pie';
import { MapData } from './list';

import { format, ZoomTransform } from 'd3';
export var MdsGetIndex = (index, city,d1,d2) => void 0


export default class Mds extends Component {

    constructor(){
        super();
        this.state = {
            data:[[ 235.94675098,-7.32438728],
            [ 156.28125955,21.95351181],
            [-396.501585, 207.85550013],
            [-179.5256502, 10.15708264],
            [-382.25596338 ,-128.33436397],
            [-158.69348615,51.61353852],
            [  83.12016742,-1.76058079],
            [  54.7435723,-14.44859157],
            [ 127.23615231,11.63141364],
            [-394.39164535 , -37.80837921],
            [ -75.31151535,  -58.72540966],
            [ -10.72151616,  -25.26853321],
            [  82.01923203 , -16.28087852],
            [ 167.21055316, 8.32366924],
            [-551.40018568,-8.54355424],
            [-203.05360916 , -19.16337169],
            [ -29.29703282,19.7031857 ],
            [  64.71505849,13.25954081],
            [-196.3588594,-58.26711498],
            [ 135.76039065, 5.56699662],
            [ 286.84008042,-6.40014563],
            [ 178.27929818,21.02370336],
            [  52.29628252,57.59283881],
            [  93.65680544  ,-18.83129722],
            [ 127.78636905,23.36753291],
            [  67.17758648,-9.58205291],
            [ 164.25074342,-6.68656806],
            [ 283.70150508, 3.23743122],
            [ 161.93454117 , -26.74309865],
            [  54.55469998 , -11.11761781]]
            // data:[[-1.21470744e+02,  1.52642580e+01],
            // [-8.35179489e+01, -1.85406043e+01],
            // [ 1.48257158e+02, -2.13355571e+02],
            // [ 9.85263564e+01, -2.04286670e+01],
            // [ 2.54386733e+02,  9.94877422e+01],
            // [ 5.85669411e+01, -4.91767565e+01],
            // [-4.80205679e+01,  7.33114671e+00],
            // [-3.71438003e+01,  2.32390829e+01],
            // [-8.11046851e+01,  1.32596773e-01],
            // [ 2.48950003e+02,  3.54675687e+00],
            // [ 7.05709325e+01,  4.50756721e+01],
            // [ 2.67490201e+01,  1.56271429e+01],
            // [-3.02548043e+01,  1.36209531e+01],
            // [-8.39868785e+01, -5.77600071e+00],
            // [ 2.64639975e+02,  5.33835528e+00],
            // [ 1.11088760e+02,  1.17914646e+01],
            // [-1.07590104e+01, -7.67832561e+00],
            // [-5.04483885e+01, -2.78995809e+00],
            // [ 1.20248142e+02,  4.88124752e+01],
            // [-7.54581487e+01,  9.90130114e-01],
            // [-1.39880743e+02,  1.09513219e+01],
            // [-1.09619392e+02, -7.76511253e+00],
            // [-7.59996838e+01, -3.41317314e+01],
            // [-3.91610138e+01 , 1.86515384e+01],
            // [-7.81156936e+01 ,-1.51922533e+01],
            // [-3.65902437e+01 , 1.40765340e+01],
            // [-7.27267052e+01 , 5.20739352e+00],
            // [-1.44742273e+02 , 3.77788880e+00],
            // [-5.90130132e+01 , 2.03275232e+01],
            // [-2.39702842e+01 , 1.15850039e+01]]
            // data:[[ -16.67479048, -122.91614666],
            // [  20.2664839  , -85.01455192],
            // [ 212.75641005 , 150.24380766],
            // [  26.32667983 , 101.4702759 ],
            // [-106.46244709 , 253.09176744],
            // [  52.76272324 ,  58.76917753],
            // [  -0.86648056 , -47.16753297],
            // [ -37.32972168 , -36.81876854],
            // [ -15.53649229 , -86.97362128],
            // [ -17.96128966 , 249.3372204 ],
            // [ -47.59748708 ,  69.98693323],
            // [ -18.1444601  ,  27.77256459],
            // [  -6.09464084 , -29.10485183],
            // [   7.08807824 , -85.16563186],
            // [   6.87845382 , 268.03108341],
            // [ -12.70801687 , 112.93094454],
            // [  22.14600153 ,  -9.11976972],
            // [  10.55703546 , -49.98332988],
            // [ -58.65973302 , 120.07965418],
            // [   1.55964888 , -76.4993318 ],
            // [  -9.34277303 ,-141.34204873],
            // [  13.83197304 ,-111.15043184],
            // [  44.85611551 , -75.23894182],
            // [ -22.38526056 , -40.33580178],
            // [  17.59566033 , -78.23051008],
            // [ -19.46651479 , -35.68606609],
            // [  -7.07506755 , -72.96975505],
            // [  -0.36140123 ,-146.2141927 ],
            // [ -25.10782125 , -60.05095795],
            // [ -14.85086576  ,-21.73118639]]
            //pca
            // data:[[-1.21470744e+02, -1.52642580e+01],
            // [-8.35179489e+01 , 1.85406043e+01],
            // [ 1.48257158e+02 , 2.13355571e+02],
            // [ 9.85263564e+01 , 2.04286670e+01],
            // [ 2.54386733e+02 ,-9.94877422e+01],
            // [ 5.85669411e+01 , 4.91767565e+01],
            // [-4.80205679e+01 ,-7.33114671e+00],
            // [-3.71438003e+01 ,-2.32390829e+01],
            // [-8.11046851e+01 ,-1.32596773e-01],
            // [ 2.48950003e+02 ,-3.54675687e+00],
            // [ 7.05709325e+01 ,-4.50756721e+01],
            // [ 2.67490201e+01 ,-1.56271429e+01],
            // [-3.02548043e+01 ,-1.36209531e+01],
            // [-8.39868785e+01 , 5.77600071e+00],
            // [ 2.64639975e+02 ,-5.33835528e+00],
            // [ 1.11088760e+02 ,-1.17914646e+01],
            // [-1.07590104e+01 , 7.67832561e+00],
            // [-5.04483885e+01 , 2.78995809e+00],
            // [ 1.20248142e+02 ,-4.88124752e+01],
            // [-7.54581487e+01 ,-9.90130114e-01],
            // [-1.39880743e+02 ,-1.09513219e+01],
            // [-1.09619392e+02 , 7.76511253e+00],
            // [-7.59996838e+01 , 3.41317314e+01],
            // [-3.91610138e+01 ,-1.86515384e+01],
            // [-7.81156936e+01 , 1.51922533e+01],
            // [-3.65902437e+01 ,-1.40765340e+01],
            // [-7.27267052e+01 ,-5.20739352e+00],
            // [-1.44742273e+02 ,-3.77788880e+00],
            // [-5.90130132e+01 ,-2.03275232e+01],
            // [-2.39702842e+01 ,-1.15850039e+01]]
       }
    }


    render() {
        console.log(this.state.data);
        return (
            <div id='svg' style={{height:'238px'}}>
                
            </div>
        )
    }

    MdsDraw (index, city, d1, d2) {
        let c = this.state.city;
        d3.select('#svg')
            .selectAll('svg')
            .remove();
       
        var width = 460;    // 可视区域宽度
        var height = 238;   // 可视区域高度
        var padding = {top: 10, right: 5, bottom:5, left:5};

        var svg = d3.select("#svg")
                .append("svg")
                .attr("width", width)
                .attr("height", height)
        // svg.call(d3.zoom().scaleExtent([0.5,5])).on('zoom', zoomed);
        // function zoomed({transform}){
        //     svg.select("g").attr("transfrom", transform);
        //     console.log("111")
        // }
        
        let dataset = this.state.data;
        let minX=100;
        let maxX=0;
        let minY=100;
        let maxY=0;
        for(let i =0;i<dataset.length;i++){
            if(dataset[i][0]<minX){
                minX=dataset[i][0]
            }
            if(dataset[i][1]<minY){
                minY=dataset[i][1]
            }
            if(dataset[i][0]>maxX){
                maxX=dataset[i][0]
            }
            if(dataset[i][1]>maxY){
                maxY=dataset[i][1]
            }
        }

       

        // console.log(minX,minY,maxX,maxY);
        var xScale=d3.scaleLinear()
                .domain([minX,maxX])
                .nice()
				.range([5,width-padding.left-padding.right]);
 
        var yScale=d3.scaleLinear()
                    .domain([minY,maxY])
                    .nice()
                    .range([height-padding.top-padding.bottom,10]);
        
        var tooltip = d3.select("#svg").append("div")
                    .attr("class","tooltip") //用于css设置类样式
                    .attr("opacity",0.0);

        var circle=svg.selectAll("circle")
                    .data(dataset)
                    .enter()
                    .append("circle")
                    .attr("fill",function (d,i) {
                        if(i===index)
                            return 'OrangeRed';
                        else
                            return 'gray'
                    })
                    .attr('id',function (d,i) {
                        return i;
                    })
                    .attr('opacity',0.7)
                    .attr("cx",function(d){
                        return xScale(d[0]);//设置圆心x坐标
                    })
                    .attr("cy",function(d){
                        
                        // console.log(yScale(d[1]));
                        return yScale(d[1]);
                        //调节y的值  调了好久 
                        //需要与设置的y轴的坐标相对应
                    })
                    .attr("r",4.5);//半径     
                    

                $(document).mouseover(function (e) {
                    let c=['北京', '天津', '河北', '山西', '内蒙古', '辽宁', '吉林', '黑龙江', '上海', '江苏', '浙江', '安徽', '福建', '江西', '山东', '河南', '湖北', '湖南', '广东', '广西', '海南', '重庆', '四川', '贵州', '云南', '陕西', '甘肃', '青海', '宁夏', '新疆']

                    circle.on("mouseover",function(d)
                        {
                        var x = e.pageX;
                        var y = e.pageY;
                        tooltip.html(c[d.target.id])
                        // 设置tooltip的位置(left,top 相对于页面的距离) 
                            .style("left",(x)+"px")
                            .style("top",(y)+"px")
                            .style("opacity",1.0);
                        })
                        .on('click',function (d) {
                            PieDraw(d1["2012"][c[d.target.id]],c[d.target.id]);
                            MapData(d2["2012"][c[d.target.id]],c[d.target.id]);
                           
                            svg.selectAll('circle').attr('fill','gray');
                            d3.select(d.target).attr('fill','OrangeRed');

                            for(let i=0;i<dataset.length;i++){
                                document.getElementById('List'+i).style.border = '2px solid #ccc';
                            }
                            document.getElementById('List'+d.target.id).style.border = '2px solid red';
                        })
                        //--鼠标移出事件
                        .on("mouseout",function(d)
                        {
                            tooltip.style("opacity",0.0);
                    }); 
                })
       

						
                    
                        
        
    }

    componentDidMount () {        
        MdsGetIndex = this.MdsDraw.bind(this);
        
    }
}
